## PANDAS - Panel Datas

In [2]:
# To install pandas if not installed in the system.
!pip install pandas

Requirement already satisfied: pandas in f:\softwares\installed files\python\lib\site-packages (1.0.1)
Requirement already satisfied: pytz>=2017.2 in f:\softwares\installed files\python\lib\site-packages (from pandas) (2019.3)
Requirement already satisfied: numpy>=1.13.3 in f:\softwares\installed files\python\lib\site-packages (from pandas) (1.18.1)
Requirement already satisfied: python-dateutil>=2.6.1 in f:\softwares\installed files\python\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in f:\softwares\installed files\python\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.14.0)

In [2]:
import pandas as pd
import numpy as np

In [14]:
# Series ha just 1 column.
s1 = pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [15]:
type(s1)

pandas.core.series.Series

In [17]:
s2 = pd.Series([6,7,8,9,np.nan])
s2

0    6.0
1    7.0
2    8.0
3    9.0
4    NaN
dtype: float64

In [18]:
type(s2)

pandas.core.series.Series

In [27]:
# Datframe has multiple columns.
s3 = pd.DataFrame([10,20,30,40,50])
s3

    0
0  10
1  20
2  30
3  40
4  50

In [10]:
s31 = pd.DataFrame([[10,20,30,40,50], [100,200,300,400,500]])
s31

     0    1    2    3    4
0   10   20   30   40   50
1  100  200  300  400  500

In [ ]:
type(s3)

In [12]:
s32 = pd.DataFrame([[10,20,30,40,50], [100,200,300,400,500], [1000,2000,3000,4000,5000]])
s32

      0     1     2     3     4
0    10    20    30    40    50
1   100   200   300   400   500
2  1000  2000  3000  4000  5000

In [14]:
s4 = pd.DataFrame([[10,20,30,40,50], [100,200,300,400,500], [1000,2000,3000,4000,5000]], 
                  index = ["ROW1", "ROW2", "ROW3"] )
s4

         0     1     2     3     4
ROW1    10    20    30    40    50
ROW2   100   200   300   400   500
ROW3  1000  2000  3000  4000  5000

In [21]:
s41 = pd.DataFrame(data = [[10,20,30,40,50], [100,200,300,400,500], [1000,2000,3000,4000,5000]], 
                  index = ["ROW1", "ROW2", "ROW3"],
                  columns=["A", "B", "C", "D", "E" ])
s41

         A     B     C     D     E
ROW1    10    20    30    40    50
ROW2   100   200   300   400   500
ROW3  1000  2000  3000  4000  5000

In [22]:
s42 = pd.DataFrame(data = [[10,20,30,40,50], [100,200,300,400,500], [1000,2000,3000,4000,5000]], 
                  index = ["ROW1", "ROW2", "ROW3"],
                  columns=["A", "B", "C", "D", "E" ],
                  dtype=float)
s42

           A       B       C       D       E
ROW1    10.0    20.0    30.0    40.0    50.0
ROW2   100.0   200.0   300.0   400.0   500.0
ROW3  1000.0  2000.0  3000.0  4000.0  5000.0

In [27]:
from numpy.random import rand as rn
np.random.seed(101)
s5 = rn(5,4)
s5

array([[0.51639863, 0.57066759, 0.02847423, 0.17152166],
       [0.68527698, 0.83389686, 0.30696622, 0.89361308],
       [0.72154386, 0.18993895, 0.55422759, 0.35213195],
       [0.1818924 , 0.78560176, 0.96548322, 0.23235366],
       [0.08356143, 0.60354842, 0.72899276, 0.27623883]])

In [33]:
row_labels = ["A", "B", "C", "D", "E"]
column_labels = ["P1", "P2", "P3", "P4"]

pd.DataFrame(data = s5, index = row_labels, columns = column_labels)

         P1        P2        P3        P4
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

In [30]:
s6 = np.array([ [1,2,3],
                [10,20,30],
                [100,200,300] ])

In [31]:
type(s6)
s6

array([[  1,   2,   3],
       [ 10,  20,  30],
       [100, 200, 300]])

In [108]:
s7 = pd.DataFrame(s6, ["A", "B", "C"], ["ONE","TWO","THREE"])
s7

   ONE  TWO  THREE
A    1    2      3
B   10   20     30
C  100  200    300

In [35]:
type(s7)

pandas.core.frame.DataFrame

In [36]:
# Viewing the data

s7.head(1)

   p1  p2  p3
A   1   2   3

In [37]:
s7.tail(1)

    p1   p2   p3
C  100  200  300

In [38]:
s7.index

Index(['A', 'B', 'C'], dtype='object')

In [39]:
s7.columns

Index(['p1', 'p2', 'p3'], dtype='object')

In [75]:
## Important difference between numpy array and pd dataframe:
# Arrays has only one data type thoughout the entire dataset.
# Dataframe has only one data type throughout one column.

In [40]:
s7.describe()

               p1          p2          p3
count    3.000000    3.000000    3.000000
mean    37.000000   74.000000  111.000000
std     54.744863  109.489726  164.234588
min      1.000000    2.000000    3.000000
25%      5.500000   11.000000   16.500000
50%     10.000000   20.000000   30.000000
75%     55.000000  110.000000  165.000000
max    100.000000  200.000000  300.000000

In [77]:
s7.T

   p1  p2   p3
A   1  10  100
B   2  20  200
C   3  30  300

In [42]:
s7.sort_index(axis = 0, ascending= False)

    p1   p2   p3
C  100  200  300
B   10   20   30
A    1    2    3

In [44]:
s7.sort_index(axis = 1, ascending= False)

    p3   p2   p1
A    3    2    1
B   30   20   10
C  300  200  100

In [111]:
# Selecting

s7.loc["B"]

ONE      10
TWO      20
THREE    30
Name: B, dtype: int32

In [81]:
s7

   ONE  TWO  THREE
A    1    2      3
B   10   20     30
C  100  200    300

In [65]:
s7[0:2] # Only Rows to be selected from row0-row2

   p1  p2  p3
A   1   2   3
B  10  20  30

In [72]:
s7[2:3]

    p1   p2   p3
C  100  200  300

In [85]:
## loc vs. iloc(Index must be selected , then columns can be selected)

#loc
s7.loc["A"]
s7.loc["A":"C"]

   ONE  TWO  THREE
A    1    2      3
B   10   20     30
C  100  200    300

In [86]:
s7.loc["A":"C", "THREE"]

A      3
B     30
C    300
Name: THREE, dtype: int32

In [89]:
# iloc

s7.iloc[0]
s7.iloc[0:3]

   ONE  TWO  THREE
A    1    2      3
B   10   20     30
C  100  200    300

In [91]:
s7.iloc[0:3, 2]

A      3
B     30
C    300
Name: THREE, dtype: int32

In [13]:
# Data imputation

s8 = s7.reindex(columns = list(s7.columns)+["E"])
s8

      A    B    C   E
p1    1    2    3 NaN
p2   10   20   30 NaN
p3  100  200  300 NaN

In [15]:
s8.iloc[0:2, 3] = 13

In [16]:
s8

      A    B    C     E
p1    1    2    3  13.0
p2   10   20   30  13.0
p3  100  200  300   NaN

In [17]:
s8.dropna(how = "any") # This removes the entire index containing the NA values.

     A   B   C     E
p1   1   2   3  13.0
p2  10  20  30  13.0

In [19]:
s8.fillna(value = 1331)

      A    B    C       E
p1    1    2    3    13.0
p2   10   20   30    13.0
p3  100  200  300  1331.0